"Service Update Failed" = "Απέτυχε η ενημέρωση υπηρεσίας";
"Service Update Complete" = "Η ενημέρωση υπηρεσίας ολοκληρώθηκε";
"Starting Service Update" = "Έναρξη ενημέρωσης υπηρεσίας";
"Dismiss" = "Απόρριψη";
"OK" = "ΟΚ";
"Call disallowed" = "Αυτός ο αριθμός δεν επιτρέπεται";
